// 1. Створити масив з 10 чисел (можна використовувати Math.random Та Math.floor). Скласти результат цих чисел в змінній result.
let array=[1,4,5,0,6,4,2,9,7,8];
let result=array;

// 2. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр
let book={
    name: 'бла-бла-ленд',
    pages: 123,
    genre: 'horror'
}
// 3. Створити об'єкт book з наступними полями  - назва, кількість сторінок, жанр, автори
let book1={
    name: 'бла-бла-ленд',
    pages: 123,
    genre: 'horror',
    autors: 'хтось там'
}
// 4. Створити маис об'єктів book з наступними полями  - назва, кількість сторінок, жанр, автори. Вивести кожну книгу як окремий об'єкт
let arr=[book, book1];
console.log(arr[0]);
console.log(arr[1]);

// 5. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значення площі зберігати в змінній s.
let height=23;
let width=10;
let S=height*width;

// 6. Напиши код, який знаходить об'єм циліндра заввишки 10м (змінна heightC) та діаметром основи 4м (dC),
// результат помістіть у змінну v.
let heightC=10;
let dC=4;
let v=((dC/2)**2)*heightC;

// 7. У прямокутного трикутника дві сторони n (зі значенням 3) та m (зі значенням 4).
// Знайдіть гіпотенузу k за теоремою Піфагора (потрібно використовувати функцію Math.pow (число, ступінь) або оператор зведення в ступінь **).
let n=3;
let m=4;
let k=((n**2)+(m**2))**1/2;