// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if(friends.length>=2){
    console.log('Великий масив,в якому  3 і більше елементи');
}else{
    console.log('Маленький масив, в якому менше 3-х елементів');
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let l=1, r=2, q=3;
if(l<r && r<q){
    console.log('2 - середнє число');
}else if (!(l<r && l<q)){
    console.log('Перше число не знаходиться між двома іншими');
}else{
    console.log('шось не то');
}

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

let result;
let a=0;
let b=5;
(a + b < 4)?result='Мало':result='Багато';

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let g=+prompt('Введіть число від -100 до 100');
(g>=-100 && g<0)?console.log('Негативне'):(g===0)?console.log('Нуль'):(g>=0 && g<=100)?console.log('Позитивне'):console.log('Не то число');